COEFFICIENTS = {
    "Органічний": (2.4, 1.05, 2.5, 0.38),
    "Напіврозділений": (3.0, 1.12, 2.5, 0.35),
    "Вбудований": (3.6, 1.20, 2.5, 0.32)
}

ATTRIBUTES = {
    "Необхідна надійність ПЗ (RELY)": [0.75, 0.88, 1.00, 1.15, 1.40, None],
    "Розмір БД додатка (DATA)": [None, 0.94, 1.00, 1.08, 1.16, None],
    "Складність продукту (CPLX)": [0.70, 0.85, 1.00, 1.15, 1.30, 1.65],

    "Обмеження швидкодії при виконанні програми (TIME)": [None, None, 1.00, 1.11, 1.30, 1.66],
    "Обмеження пам'яті (STOR)": [None, None, 1.00, 1.06, 1.21, 1.56],
    "Нестійкість оточення віртуальної машини (VIRT)": [None, 0.87, 1.00, 1.15, 1.30, None],
    "Необхідний час відновлення (TURN)": [None, 0.87, 1.00, 1.07, 1.15, None],

    "Аналітичні здібності (ACAP)": [1.46, 1.19, 1.00, 0.86, 0.71, None],
    "Досвід розробки (AEXP)": [1.29, 1.13, 1.00, 0.91, 0.82, None],
    "Здібності до розробки ПЗ (PCAP)": [1.42, 1.17, 1.00, 0.86, 0.70, None],
    "Досвід використання віртуальних машин (VEXP)": [1.21, 1.10, 1.00, 0.90, None, None],
    "Досвід розробки на мовах програмування (LEXP)": [1.14, 1.07, 1.00, 0.95, None, None],

    "Застосування методів розробки ПЗ (MODP)": [1.24, 1.10, 1.00, 0.91, 0.82, None],
    "Використання інструментарію розробки ПЗ (TOOL)": [1.24, 1.10, 1.00, 0.91, 0.83, None],
    "Вимоги дотримання графіка розробки (SCED)": [1.23, 1.08, 1.00, 1.04, 1.10, None]
}

EARLY_DESIGN_MULTIPLIERS = {
    "PERS": [2.12, 1.62, 1.26, 1.00, 0.83, 0.63, 0.50],
    "PREX": [1.59, 1.33, 1.22, 1.00, 0.87, 0.74, 0.62],
    "RCPX": [0.49, 0.60, 0.83, 1.00, 1.33, 1.91, 2.72],
    "RUSE": [None, None, 0.95, 1.00, 1.07, 1.15, 1.24],
    "PDIF": [None, None, 0.87, 1.00, 1.29, 1.81, 2.61],
    "FCIL": [1.43, 1.30, 1.10, 1.00, 0.87, 0.73, 0.62],
    "SCED": [None, 1.43, 1.14, 1.00, 1.00, None, None]
}


EFFORT_MULTIPLIERS = {
    "ACAP": [1.42, 1.29, 1.00, 0.85, 0.71, None],
    "AEXP": [1.22, 1.10, 1.00, 0.88, 0.81, None],
    "PCAP": [1.34, 1.15, 1.00, 0.88, 0.76, None],
    "PCON": [1.29, 1.12, 1.00, 0.90, 0.81, None],
    "PEXP": [1.19, 1.09, 1.00, 0.91, 0.85, None],
    "LTEX": [1.20, 1.09, 1.00, 0.91, 0.84, None],
    "RELY": [0.84, 0.92, 1.00, 1.10, 1.26, None],
    "DATA": [None, 0.23, 1.00, 1.14, 1.28, None],
    "CPLX": [0.73, 0.87, 1.00, 1.17, 1.34, 1.74],
    "RUSE": [None, 0.95, 1.00, 1.07, 1.15, 1.24],
    "DOCU": [0.81, 0.91, 1.00, 1.11, 1.23, None],
    "TIME": [None, None, 1.00, 1.11, 1.29, 1.63],
    "STOR": [None, None, 1.00, 1.05, 1.17, 1.46],
    "PVOL": [None, 0.87, 1.00, 1.15, 1.30, None],
    "TOOL": [1.17, 1.09, 1.00, 0.90, 0.78, None],
    "SITE": [1.22, 1.09, 1.00, 0.93, 0.86, 0.80],
    "SCED": [1.43, 1.14, 1.00, 1.00, 1.00, None]
}

SCALE_FACTORS = {
    "PREC": [6.20, 4.96, 3.72, 2.48, 1.24, 0.00],
    "FLEX": [5.07, 4.05, 3.04, 2.03, 1.01, 0.00],
    "RESL": [7.07, 5.65, 4.24, 2.83, 1.41, 0.00],
    "TEAM": [5.48, 4.38, 3.29, 2.19, 1.10, 0.00],
    "PMAT": [7.80, 6.24, 4.68, 3.12, 1.56, 0.00]
}

ENV_FACTORS = [
    "Канали передачі даних",
    "Розподілені обчислення",
    "Вимоги до продуктивності",
    "Конфігурація з обмеженням",
    "Частота транзакцій",
    "Інтерактивний запит і/або запис",
    "Ефективність на рівні кінцевого користувача",
    "Інтерактивне оновлення",
    "Складна обробка",
    "Повторне використання",
    "Спрощення перетворення/установки",
    "Спрощення операції",
    "Використання не декількох вузлів",
    "Потенціал зміни функції"
]

LANGUAGES = {
    "C++": 53,
    "Java": 55,
    "JavaScript": 54
}